1. Написать два класса Enum - Suit и Rank. Suit - масть карт(DIAMONDS,CLUBS,HEARTS,SPADES),
 Rank - ранг карт(JACK,QUEEN,KING,ACE).
2. Создать класс Card  в котором будут две переменные с типами enum классов Suit и Rank, 
а также конструктор, который будет в эти переменные записывать новые значения при создании
 нового экземпляра класса card, перепишите метод toString
 который будет возвращать масть и ранг карты, а так же гетеры которые возвращают ранг и масть
2.  Написать класс Deck, экземпляры которого представляют собой полную колоду карт. 
Заполнение осуществлять в конструкторы класса
3.  Написать метод для перевода названия карт на русский язык.
4.  Написать метод для получения названия всех карт на русском языке.
5.  Вывести на экран перевод Туза.
6.  //Переопределить метод toString в классе Rank и классе Suit.
7.  Создать метод в классе Suit, где будет хранится количество карт каждой масти.
8.  Вывести на экран название масти.
9.  Получить ранг карты с переводом на русский язык.
10. Вернуть порядковый номер константы Король (индекс Enum).